tap "moncho/dry"
brew "azure-cli"
brew "bat"
brew "btop"
brew "docker-compose"
brew "dockutil"
brew "dry"
brew "exiftool"
brew "eza"
brew "falco"
brew "fzf"
brew "gemini-cli"
brew "ghidra"
brew "git"
brew "git-delta"
brew "git-gui"
brew "gnupg"
brew "gobuster"
brew "hydra"
brew "john-jumbo"
brew "katana"
brew "lazygit"
brew "lua-language-server"
brew "masscan"
brew "neofetch"
brew "neovim"
brew "nmap"
brew "nowplaying-cli"
brew "nushell"
brew "oh-my-posh"
brew "ollama"
brew "pam-reattach"
brew "sherlock"
brew "shodan"
brew "socat"
brew "telnet"
brew "theharvester"
brew "tmux"
brew "xplr"
cask "android-studio"
cask "brave-browser"
cask "caido"
cask "claude"
cask "claude-code"
cask "docker-desktop"
cask "firefox"
cask "github"
cask "google-chrome"
cask "iterm2"
cask "karabiner-elements"
cask "keka"
cask "kitty"
cask "maltego"
cask "notion"
cask "obsidian"
cask "postman"
cask "powershell"
cask "rectangle"
cask "suspicious-package"
cask "teamviewer"
cask "temurin"
cask "visual-studio-code"
cask "wireshark-app"
vscode "anthropic.claude-code"
vscode "christian-kohler.path-intellisense"
vscode "dracula-theme.theme-dracula"
vscode "esbenp.prettier-vscode"
vscode "foxundermoon.shell-format"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "josemurilloc.aura-spirit-dracula"
vscode "ms-azuretools.vscode-containers"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpp-devtools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.powershell"
vscode "oracle.oracle-java"
vscode "pkief.material-icon-theme"
vscode "redhat.java"
vscode "rosshamish.kuskus-kusto-syntax-highlighting"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "timonwong.shellcheck"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.migrate-java-to-azure"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-java-upgrade"
vscode "vscjava.vscode-maven"
vscode "yzhang.markdown-all-in-one"
